var demoversion = (page = 1, limit = 20, callback) => {
  let fn = (time, text, list) => {
    return {
      timeout: demo.timeout(time, 'object'),
      title: text || '例行维护',
      children: list || []
    }
  }

  let all = [
    fn('1672502400000', '版本重构', ['园所端新版本测试上线']),
    // fn('1673539200000', '计划新增功能', [
    //   '我的-教育局管理模块',
    //   '表单列表-分析表-生源分析表/同时加入至招生工作-辅助工具',
    //   '表单列表-分析表-园所竞争分析表/同时加入至招生工作-辅助工具',
    //   '招生工作-招生海报功能',
    //   '班级圈-点击头像进入个人班级圈',
    //   '无园所id时注册-获取全部园所'
    // ]),
    // fn('1675328961829', '功能变更', [
    //   '工作-班级工作-学期相册 1.ui变更。2.选择宝宝页增加群发相册功能(即不用选择宝宝也可以添加相册)。3.增加删除单张照片功能',
    //   '注册时可选择性注册不同园所',
    //   '新增扫码登录',
    //   '工作-保健工作-宝宝食谱 1.新增删除食谱 2.新增修改食谱'
    // ]),
    // fn('1675907063154', '功能优化', [
    //   '对选择班级权限进行了优化! (1):用户是班级老师时选择班级只返回当班级老师所在班级。(2):反之返回全部班级',
    //   '对部分权限进行了深度优化',
    //   '设置-开发者选项 显示(慎用)',
    //   '我的-我的资料显示班级老师任教班级',
    //   '对图标、登录页样式进行回滚'
    // ]),
    // fn('1676267958016', '', [
    //   '对学期功能进行改版更新,现使用户都能使用该功能',
    //   '新增功能生源分析表',
    //   '新增功能园所竞争分析表'
    // ]),
    // fn('1677222716046', '', [
    //   '新增用户反馈功能，用于收集用户提出的建议/改进!位置：我的-设置-用户反馈',
    //   '新增上传日志功能,用户错误信息提交!位置：我的-设置-日志-上传日志'
    // ]),
    // fn('1677657691299', '', [
    //   '新增数据管理，用于变更“园所数据模块”是否与“财务模块”的数据相匹配，位置：工作-园务工作-数据管理',
    //   '新增权限控制。涉及功能有：'
    // ]),
    // fn('1678242961347', '', [
    //   '功能“签名”改为“签名模板”,且最大只能上传5张签名',
    //   '家园联系册可使用签名模板里的签名代替每次签名',
    //   '审批功能更改为只能搜索物品，去掉了根据分类搜索物品。若想使用分类搜索，请在-我的->设置->功能设置->审批功能常规版 点击打开',
    //   '班级管理优化'
    // ]),
    // fn('1679648120697', '', [
    //   '图标变更，使图标统一化',
    //   '新增积分提现功能',
    //   '对园所数据模块功能进行了部分变更，并在工作-园务工作-数据管理功能中变更',
    //   '新增宝宝请假审批,位置：工作-班级工作-请假审批',
    //   '对用户页进行优化'
    // ]),
    // fn('1681107252317', '', [
    //   '新增设备管理,对人脸设备进行管理操作',
    //   '对功能用户手册(帮助)优化，增加二级菜单'
    // ]),
    // fn('1682329203091', '', [
    //   '新增功能权限控制管理,对园所端，家长端控制不想展示的功能'
    // ]),
    // fn('1684572035197', '', [
    //   '新功能-芝圃国学',
    //   '对考勤模块进行了优化，增加考勤打卡及对打卡位置设置等功能，并对该功能位置进行变更：我的->我的考勤 变更至 首页->我的考勤',
    //   '新增功能-投票',
    //   '新增功能-家园联系册模板,可在园务工作->功能管理->家园联系册模板进行变更',
    // ])
  ]

  let versionarr = [1, 0, 0]
  for (let i = 0; i < all.length; i++) {
    let r = all[i]
    let t = r.timeout
    if (i === 0) {
      all[0].version = versionarr
    } else {
      let ver = [0, 0, 0]
      let up = all[i - 1]
      let upt = up.timeout
      if (t.y === upt.y) {
        ver[0] = up.version[0]

        if (+t.m === +upt.m) {
          ver[1] = up.version[1]
          ver[2] = up.version[2] + 1
        } else {
          ver[1] = up.version[1] + 1
          ver[2] = 0
        }
      } else if (t.y - upt.y > 0) {
        ver = [up.version[0] + t.y - upt.y, 0, 0]
      }
      all[i].version = ver
    }
  }

  let temp = JSON.parse(JSON.stringify(all.reverse())).map(s => {
    s.version = s.version.join('.')
    return s
  })

  function _ret(arr) {
    if (callback) {
      callback(arr)
    }
    return arr
  }

  let atemp = demo.array(temp).chunk(limit)

  let total = atemp.length
  if (page > total) {
    return _ret([])
  } else {
    return _ret(atemp[page - 1])
  }
}
